#!/bin/bash
#
#    Copyright ©DeNA Co.,Ltd. All rights reserved.
#
#    
#    清楚日志 ./logs ...
#
#    Authors:  
#    lushichao 2014-09-21 <shichao.lu@denachina.com>
#
#    Last update:
#    lushichao 2014-09-21


# ----------------------------------------------------------------------------------------
# 获取并验证命令行参数.
# ----------------------------------------------------------------------------------------
while getopts "m:h" arg
do
    case ${arg} in
        m)
            MAXDEPTH=${OPTARG}
            ;;
        h)
            echo -e "\nUsage: $0"
            echo -e "---------------------------------------------------------------------------------------"
            echo -e "\033[32m-m MAXDEPTH                Find maxdepth,eg:2 all.\033[0m"
            exit 1
            ;;
        ?)  #当有不认识的选项的时候arg为?
            echo "Try \`$0 -h' for more information."
            exit 1
            ;;
    esac
done
shift $((${OPTIND} - 1))

if [ "${MAXDEPTH}" == "" ]; then
    echo "Try \`$0 -h' for more information."
    exit 1
elif [ "${MAXDEPTH}" == "all" ]; then
    MAXDEPTH=""
else
    MAXDEPTH="-maxdepth ${MAXDEPTH}"
fi


# ----------------------------------------------------------------------------------------
# 模块变量.
# ----------------------------------------------------------------------------------------
# -----> Global Variables
LIB_DIR=`dirname "$0"`/../lib
SOFTWARE=`dirname "$0"`/../software
source ${LIB_DIR}/global_var.sh
# <----- Global Variables


# ----------------------------------------------------------------------------------------
# 打印并保存日志信息.
# ----------------------------------------------------------------------------------------
source ${LIB_DIR}/save_message.sh    # 导入函数 save_message


# ----------------------------------------------------------------------------------------
# 通用初始化部分.
# ----------------------------------------------------------------------------------------
source ${LIB_DIR}/global_initialize.sh    # 导入函数 global_initialize


# ----------------------------------------------------------------------------------------
# 通用结束部分.
# ----------------------------------------------------------------------------------------
source ${LIB_DIR}/global_finalize.sh    # 导入函数 global_finalize


# ----------------------------------------------------------------------------------------
# 非通用初始化部分.
# ----------------------------------------------------------------------------------------
function own_initialize {
    LOGS_DIR="${CWD}/../logs"    

    save_message ${FUNCNAME} "info"
}


# ----------------------------------------------------------------------------------------
# 查找logs路径下最多两层.log日志文件并删除.
# ----------------------------------------------------------------------------------------
function find_logs_rm {
    find ${LOGS_DIR} ${MAXDEPTH} -name "*.log" | xargs rm -f
    #echo "find ${LOGS_DIR} ${MAXDEPTH} -name "*.log" | xargs rm -f"

    save_message ${FUNCNAME} "info"
}





# ----------------------------------------------------------------------------------------
# 主执行逻辑.
# ----------------------------------------------------------------------------------------
function main {
    global_initialize "$$" "$0"
    own_initialize
    find_logs_rm
    global_finalize 0
}

main
