#!/bin/bash
#
#    Copyright ©DeNA Co.,Ltd. All rights reserved.
#
#    
#    环境最大化
#
#    Authors:  
#    lushichao 2014-09-21 <shichao.lu@denachina.com>
#
#    Last update:
#    lushichao 2014-09-21


# ----------------------------------------------------------------------------------------
# 获取并验证命令行参数.
# ----------------------------------------------------------------------------------------
while getopts "h" arg
do
    case ${arg} in
        h)
            echo -e "\nUsage: $0 "
            echo -e "---------------------------------------------------------------------------------------"
            echo -e "\033[32mThe environment to maximize.\033[0m"
            echo -e ""
            exit 1
            ;;
        ?)  #当有不认识的选项的时候arg为?
            echo "Try \`$0 -h' for more information."
            exit 1
            ;;
    esac
done
shift $((${OPTIND} - 1))


# ----------------------------------------------------------------------------------------
# 模块变量.
# ----------------------------------------------------------------------------------------
# -----> Global Variables
LIB_DIR=`dirname "$0"`/../lib
SOFTWARE=`dirname "$0"`/../software
source ${LIB_DIR}/global_var.sh
# <----- Global Variables


# ----------------------------------------------------------------------------------------
# 打印并保存日志信息.
# ----------------------------------------------------------------------------------------
source ${LIB_DIR}/save_message.sh    # 导入函数 save_message


# ----------------------------------------------------------------------------------------
# 通用初始化部分.
# ----------------------------------------------------------------------------------------
source ${LIB_DIR}/global_initialize.sh    # 导入函数 global_initialize


# ----------------------------------------------------------------------------------------
# 通用结束部分.
# ----------------------------------------------------------------------------------------
source ${LIB_DIR}/global_finalize.sh    # 导入函数 global_finalize


# ----------------------------------------------------------------------------------------
# 非通用初始化部分.
# ----------------------------------------------------------------------------------------
function own_initialize {


    save_message ${FUNCNAME} "info"
}


# ----------------------------------------------------------------------------------------
# 导入check_command模块.
# ----------------------------------------------------------------------------------------
source ${LIB_DIR}/check_command.sh


# ----------------------------------------------------------------------------------------
# 初始化yum.
# ----------------------------------------------------------------------------------------
function set_yum {
    rpm -ivh ${SOFTWARE}/epel-release-5-4.noarch.rpm
    rpm -ivh ${SOFTWARE}/rpmforge-release-0.5.2-2.el5.rf.i386.rpm

    save_message ${FUNCNAME} "info"
}


# ----------------------------------------------------------------------------------------
# 最大化环境.
# ----------------------------------------------------------------------------------------
function environment_maximize {
    #git
    check_command "git"

    #md5sum
    check_command "md5sum"

    #dos2unix
    check_command "dos2unix"

    #unzip
    check_command "unzip"

    if [ "${notcommand_list}" != "" ];then
        for com in ${notcommand_list}
        do
            yum -y install *${com}* \
            || { save_message ${FUNCNAME} "error" " yum -y install *${com}* ."; global_finalize 000104;}
        done
    fi


    save_message ${FUNCNAME} "info"
}


# ----------------------------------------------------------------------------------------
# 主执行逻辑.
# ----------------------------------------------------------------------------------------
function main {
    global_initialize "$$" "$0"
    own_initialize
    set_yum
    environment_maximize
    global_finalize 0
}

main
